{"pages":[{"title":"关于","text":"关于本站 已经不知道是第几个博客了，之前的都因包括但不限于手贱删库或玩炸等主观或客观事故消失在了历史的洪流中。 网站基本信息 域名：LiCaoZ.COM 和我名字有关的一个比较短的主流的域名 已续费至 2031-11-19 14:03:25 域名注册服务商：烟台帝思普网络科技有限公司（DNSPod, Inc.） 公安联网备案号：渝公网安备 50011702500718号 暂未进行工信部 ICP 备案，别问，问就是重庆通管局要求至少满 16 才能备案。 基于 Hexo v5.4.0 / Icarus / Vercel / CloudFlare Free Plan 网站语言：简体中文 / English 关于我 是一朵绽放在田野的灿烂菜花，啥都不会，手头有一个 工作室。 一个你应该能猜到年龄的零七年六月份的初三学生；嘉陵江畔，合中学子，在班上混得还不错，想上本部高中，期待有一天能够成为家长口中“别人的孩子”。 出生以及前11年生活在人口大省的鹰城湛河区，当前坐标重庆合川。 出没在互联网的每一个角落。 学校监控美食区 / 娱乐区 / 生活区UP主 是个吃吃吃货，每天一杯牛奶必不可少。 性格 或许 比较内向，不善于 在现实中 主动和人搭话。 十六型人格测试 - INTP / INFP 反复横跳 以及 本站已加入十年之约 &amp; 中文独立博客列表，期待十年后再见到你~ 感谢 又拍云联盟 提供中国大陆范围内的免费 CDN加速/云存储 服务 虽然我这个域名没备案用不了就是了 本站由 GitHub / Hexo / Icarus 主题 / Vercel / CloudFlare 联合驱动，在此衷心感谢他们的支持 感谢在我建站路中帮助过我的小伙伴们","link":"/about/index.html"},{"title":"语录","text":"收集一些语录，一般来说是励志、哲学类的……？ 如果当你一天到晚拿着手机、刷着微博、坐在家里、宅着看电视、天天上着网。做着那些八十岁以后都能干的事，你要青春干什么呢？——撒贝宁 我们很多时候是不是觉得我们抓的牌实在是太差了呀，但是再差的牌你都应该打下去。——罗翔 古希腊哲学家爱比克泰德曾经说过的一句著名的话，他说我们登上并非我们所选择的舞台，演出并非我们所选择的剧本。各位同学有谁是自愿来到这个世界上的，有谁来到这个世界上父母征求过你的意见，我们登上并非我们所选择的舞台，各位同学有谁的人生剧本是你自己选择的。大家是不是羡慕别人的剧本，老实说我有的时候也很羡慕别人的剧本，但是没有办法，你的剧本不是你选择的，你只有努力地把你的剧本给演好；虽然很痛苦，但是只要努力地演好你的剧本，在痛苦中也有精彩。每个人的人生剧本都是独特的，每个人的人生剧本都是精彩的，不要去羡慕别人。——罗翔 我们登上并非我们所选择的舞台，在座的有谁的剧本是你自己设定的，其实不是的，仔细想一想，我们决定不了我们的出身，我们决定不了我们的智商，我们更决定不了我们这一生的贵人相助。很多时候我们经常会羡慕别人的剧本，我有的时候就非常羡慕别人的剧本，但是没有谁的剧本值得羡慕，你只能把你自己的剧本给演好。如果在你的一生中真的遭遇到这些挫折，那对不起，这就是你的剧本。你有两种选择，一种选择是弃演，一种选择就是把既定的剧本给选好，给演好，所以希望大家能够演好自己的剧本。——罗翔 愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光，就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。此后如竟没有炬火：我便是唯一的光。——鲁迅《热风》 今早雾霾蔽日，但是不要害怕，太阳依旧在云端。——罗翔 我们虽然看不到正义，但不代表正义这个概念不存在，它依然是我们前进的方向。 我们所有的法律人为什么要追求公平、正义？因为正义是客观存在的，它不断的挑动着我们的心弦，让我们“虽不能至，心向往之”，这就叫做正义。——罗翔 我们人类所有的思考其实都是建立在相信的基础上，我们相信存在正义，而正义一定是客观存在的。 ——罗翔 越能体现人性尊严的快乐，越是一种最大的快乐，因为它跟人的尊严是有关的。有很多快乐，这是放纵的快乐，有很多快乐是降低了人性的尊严；而越能体现人性尊严的快乐，越是一种高级的快乐。我们之所以读书、行路，其实就是希望我们能够不断地享受什么的快乐呢，高级快乐。——罗翔 当你觉得这个世界有大量的不正义，是不是有不正义相对应的一个概念叫做什么，叫做正义。如果这个世界上没有正义，那么说它不正义就毫无意义；而我们正是相信这个世界上有正义，所以我们要用我们所学习的法律知识，去不断地去追寻正义——虽然这个追寻是渐进的，但是我们永远不灰心、不疲倦，我们尽力而为。——罗翔 我始终是认为法律一定要倡导良善的价值观，这个世界上还是有价值观的，我非常欣赏英国剧作家切斯特顿的一句话，他说一个开放的社会就像一张张开的口，合下来的时候一定要咬住某种坚实的东西，天变地变，道义不变。——罗翔 历史的经验告诉我们，权利导致腐败，绝对权力往往导致绝对腐败。——罗翔 问渠那得清如许，为有源头活水来。培根说什么，一次犯罪不过是污染了水流，而一次不公正的司法却是污染了水源。——罗翔 对于私权而言，只要法律没有禁止的，就是我们的权利；对于公权而言，只要法律没有授权的就是被禁止的。——罗翔 与其说从小让孩子树大志长大干大事，其实这是中国人活得累的第一次教育。人是有区别的，别人比自己好，我们应该以什么样心态？同样是鼓掌的心态，而不是沮丧的心态。——郑强 千万别相信什么人生别输在起跑线上这样的话，只有百米短跑才在乎起跑线。人生是一场马拉松，马拉松起跑你看过谁站起跑线上，大家都一堆出发，谁能坚持到最后才最关键。——撒贝宁 勘误/投稿可直接在下方评论或给我发送邮件联系~","link":"/quotations/index.html"}],"posts":[{"title":"一个饮料瓶的“旅行”","text":"​ 你好，我是一个饮料瓶，曾经光鲜亮丽地被摆在货架上并拥有着极其高昂的身价。 ​ 每天，我在货架上欣赏着穿着千奇百怪的各式各样的人熙熙攘攘地从商店前经过，直到有一天，我被一个孩子买了下来。 ​ 孩子貌似很喜欢我的“衣服”——那层花花绿绿的包装，拿在手里把玩了好一阵子，可惜孩子的家长看起来很不欢迎我。“你没事把一个破烂瓶子带回去干什么，啥用都没有还占地方。”孩子的父母一边说道着孩子一边把我从孩子手里抢过来扔进了垃圾桶里。 ​ 就这样，我被错误地放进了不可回收箱——我，一个可回收的环保饮料瓶，居然被扔进了不可回收箱——这简直是一件天理难容的事情。不幸中的万幸是——在经过了漫长等待后，我被一个收破烂的老爷爷捡到了袋子里。在此之前，我清楚地看到老爷爷那如同干枯树皮一般的皮肤，眼眶凹陷，头上的皱纹是我以前在过路人中从未见过的，所剩无几的头发在太阳的照耀下发出耀眼的银白色的光芒。 ​ 进了袋子，我不禁直呼一声好家伙！老爷爷的口袋真是别有洞天 ，有红的橙的黄的绿的青的蓝的紫的五颜六色的瓶子，有的叫农夫山泉、有的叫元气森林，有的叫蜜雪冰城、有的叫茶百道……五颜六色、花里胡哨的兄弟们在老爷爷的口袋里齐聚一堂，诉说着自己的遭遇。 ​ 相比之下，我那“天理难容”的经历居然算比较好的了，我只是被错丢了垃圾箱，有的“难兄难弟”甚至是被直接扔到了地上任凭行人车蹂躏。 ​ 路上，我们也听到老爷爷在那里自言自语地诉说着生活的艰辛——老爷爷的家庭属于典型的“三无家庭”，好不容易辛苦打拼供养儿子考上了大学，毕业后找工作又因为家境被歧视，儿子好不容易谈了个喜欢的对象，喜得贵子，却又不幸夭折，老二长大后在学校不学无术，天天惹事，让一家人操碎了心，老爷爷的老伴更在这期间患上了重病……多方压力下，老爷爷本就贫寒的家庭变得负债累累，食不果腹，不得已出来靠拾破烂维持生计。 ​ 诉说这些经历时，老爷爷的双手不断颤抖着，泪水打湿了袋子，沁进了乡间小道的泥土里。 ​ 不知过了多久，我们到了废品回收站，我们伴随着“哗啦”一声被全部倒到了地上，被回收站老板逐一放气压扁，码放在一起。 ​ 在老板的话中我们得知，我们的下一站将是垃圾回收利用公司，我们将在那里被分拣、处理，走上新的“瓶”生道路。 ​ 或许，我会被制成食品级聚酯切片后，再次做成饮料瓶，实现“瓶到瓶”的原级循环利用；或许，我会被热分解后变成油类物质、一些可利用的气体和残渣；或许，我会被醇解以获得多元醇类产品；或许…… ​ 无论是什么处理方式、最后的我会变成什么样子，我都会记得那位为更好的环境做贡献的老爷爷，记得在我“瓶”生中出现的每一个人、每一件事——他们都是我完整“瓶”生所不可或缺的一部分，感谢他们的出现，让我“瓶”生的旅途更加圆满无缺。 参考 废瓶怎样不再成废品（绿色焦点·固废处置咋提速③）–生态–人民网 塑料包装废物的回收再生工艺流程有哪些_已解决 - 阿里巴巴生意经 说点题外话 本文来源于那周语文老师布置的一篇作文，写得稀烂，希望他还没看。","link":"/post/a-trip-with-a-drink-bottle/"},{"title":"新邮箱 &amp; GPG 密钥启用","text":"更换了邮箱和 GPG 密钥 新邮箱 更换了新邮箱 admin@licaoz.com，原邮箱会暂时保留至我 满足重庆管局备案要求，但不是首选项。 在此过渡期间，原邮箱的信件处理可能会减少。 新邮箱使用的腾讯企业邮可能会造成部分邮件退信，请将被退信邮件在过渡期内发送给原邮箱。同时求一个收信稳定不乱退信的企业邮（最好是免费的），欢迎在评论区告知——G Suite就免了，一是本地网络环境问题，二是穷。 新GPG密钥 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859-----BEGIN PGP PUBLIC KEY BLOCK-----Comment: 用户编号: CaoZhi Li &lt;admin@licaoz.com&gt;Comment: 连接时间: 2021/11/20 19:53Comment: 过期时间: 2031/11/18 19:53Comment: 文件系统: 4,096 位 RSAComment: 用途: 签名, 仅加密, 正在认证的用户编号Comment: 指纹: 1C743A8012B465F4A31B5B2D8A76DACB6D8D5255mQINBGGY4a4BEAChGcJpQU1dwYGjatsEbP2870QrO/Lhx1lyv9m1dqjx5Wp9fa43jrCgRbWbizrvGdxqjFvsG6DWkroq9sx8tuFWmitb0wmijJTEMybv5IXi6bfiGEV2d9PTP+xDRu7cflMve1G5HbMS9YNwSngKgU8nInQLLfVbPTrBWAHAqoJCgm26976fjNrlBKgoa421/qGUiOAH3TjmcrTM1DfLW24WsxWMvyNcNdaA0WEkf9sqt+H53M9wk7p/l76Ng68bzw5mJj0VPa2AgX06tJY5cPlp00giwT41h1fbmTcLocdxQj5kL4YiBS3qP8CDhmxyfoOovGSNNWXLLteiNy0fnfSVj9Hhh8f4BH2TNHZ9J6hvF89miy++V1lIj1N/F0GJ0NASrTi98K2LQotS8pJvrOWzE9z8c6nwa7TQfgDjCEimIOH8cACZjMbPL32L8h0qseJd9Kuljhy7K9U2WfuCMgKgfALhPcolizR77+eXzmvgWZt8Ofkikg6Qy0Wrzn8dtx7T3F6Tllsr+Zc25EAK8s6M0jkebDKHDsb5q4hvxlDchQUpzayEjlNTLvHfUSbAsZ3kZIMXkmefeB0/XZHSPVhoux0c6OtGBhnvkBManZF0n4wN+1kyuPufcLQQJT6H9f1AAtT76bcAQJXIzss/pAntPNFvhNDknJkD+nM1hIbY/wARAQABtBxDYW9aaGkgTGkgPGFkbWluQGxpY2Fvei5jb20+iQJUBBMBCAA+FiEEHHQ6gBK0ZfSjG1stinbay22NUlUFAmGY4a4CGwMFCRLMAwAFCwkIBwIGFQoJCAsCBBYCAwECHgECF4AACgkQinbay22NUlU5/g//YP5v6i3OC8WMqcOG2sV3b9Zv4SJ5nRjj8I1P+uumPi2bHkZAE7V72fPMIA/yOqBZ2QGIPYAaUfTbNwlSKDwPckcqxuLZjKc3gyVFAn3TMrr1wTzVQkl6bQgZka1TrSJHp30/Rrb6/rr2maPJSciVHCOvPor43LjTkEVpTHzvxu+nMmu3EBVbO0cv1/ylPtn0WhMAPqPGw0CoWufl8kIOfiPqL+NNNlmx6sIEUdhoZQ+c0LwsefvT0yJMoJXBQo1crDxDxObE0ZoRDH+vI6DKEM+TwdTI4l3keckoRvRuZSuaZMc+cTI14OKWnSOrtoW9L0co7RGhCbtW53tBlat57hr/8a6fAUqlawV1xdeYwSja+AYyJENeNKX2JdknbKD8WQNKVjlrwbhTB7u8B/14DVejsvmmrUXS01eisLYddG7hDC3z/DW9rTe10kmm+vNsbHoBkxmZqvCtxivB+T8K/VMHQ1ON7i4k653o61Gj3K3G55nJll3oMMrh1V3AGy7EFlKJFuCfn8hRhRZBYZatiBLH5SqFURpDQA7W9OIX6F/Ur6CNkSMsmWucoRGU7RJmQBBB7NA25/VWYLd7Jr49ij2D1Jh355QjwMXSq3mTKNh8jkgqdNpuupdsRT8qkw3EX8EhsjAF21hlqggylOUE3Ei4m3Me/GRQAQ2QAcJz0qi5Ag0EYZjhrgEQAL0rEOetEgcFt789uT+kDNAzjdRpT6/Lq2MT9fJxmqaG3m3F5hXBqtxuWuE0UzOZs27UvKycUQTqwaQHJtQLw3cf6cBO+Zd7WQfEyNbwdAbI62J/37jX+qXHL3ehU5gFSZhnE48aaozuC3BNQSqNcyAS7qvYn62WuzPJ9Q4/i+DWlHP51qbDKJA0mVh/oppDSWe48FK05lbcF/D9bdTxI5XyV1qmawxd7rrdJYKpBojKLqYTBe6rBQ3x9ZHjZRc9EauGwFsYRkYhATBixF511U0xmAJ69Eru7qUwedDlBLHpxMt9rMh3z2uDVpvtMN9rn5XEoukUGXDvkkoSHJWV+0qCSaIEIH5K+jkpIPcp9TqaIV5MnUOwjzwtLAl3UQy8P36iyxAoaXInFgco4Q85XOE8yAvTjdQvzEEh44w+Y+TRsx2TWQAmcat0E9a6EgsaI3jDfqbQ8TZPQm9hCaiHomK61m2ECmGufQmn/183nATat6JipK1eT2Ylm1tGvAvtWQZvqikfoloiqYLWpZvB5CmJnJKfxQwxABlRby4GzydMCZeOHtJxwS/kyD1SO2sJDelCy6BtKqFseREnTmzVpOAOgLqyve/fwLupdefY57r9SUj3f498dKeySOjhkeJdWWpnby2ztv4zWd0JMCJcgXXPegLi07nvBKADiIDyL09pABEBAAGJAjsEGAEIACYWIQQcdDqAErRl9KMbWy2KdtrLbY1SVQUCYZjhrgIbDAUJEswDAAAKCRCKdtrLbY1SVV6mD/dGomFGLH8cZ/5Vg7SUWgwEdtdPnPR/p8l6Mx2m6H1adGWuKrNmaPRBWzRX3c4+zO6sPu9J6fpgadtTT51Fwvms2qKeXtQEkvXWaz9eeBTOqvg7PQws5liKlO2wYL+X+n2RGTOGsmVqLIAOdJIxoG6tOjx9PQG3YwKuJ3hWo9Q5N6S9YQQnOjqwox4pf7wQHiixPE81IOCaWfGv+BLH7RX6RQcCODH2RNPp6RQy1hMVxZBdKE8gachwkM6/00TjEgaeCLAJlQr3XWx1YhJXQNWvJkYqQWf5KL+1arvXigu1gx61xeWwQyLDAcPXwaml0Fueh7ghxzzQ1577AZ8SaGaVxZsJImRr18gPDu5kMC0C1JLg0owFUH2LwpHVmNbYtjL0w+Dcbxgoqm2bp5Ymi16LczSIME+w1lu2N3jG+96t0gyHHcmdMb66x19OqtGxKhOI7d48rYb06L9J2BpgdzggVMmeSt0Pe9aL568VEmSH1Q9/wB5ftQAmKhyDIV4FNUke1V82B1gjNQp26jTtCgjeivcywvBm3RP3Klfve2/12KCJwi+2yNuiqYQ2N+7IplgSOwh1WWlq7LmrlMceW56Wnrl5TTEy+JNN/owk45/s7OxQ9zg+GchHnF6FV9yuRSf+vmuY8LfjO4tQgWpp93TH84ZKJL5oEpniCdb0NjfQ=PXu0-----END PGP PUBLIC KEY BLOCK----- 已在 GitHub 上传新密钥并在本地 Git 配置并使用新GPG密钥。","link":"/post/active-new-mailbox/"},{"title":"乔治小站 API 服务","text":"本站提供了一些或许会用到的 API 服务。 本 API 不提供 SLA 保证，不建议在对可用性严格要求的生产环境使用，您可复制源代码自行部署。 获取访问者端口 如果服务端无法通过类似 $_SERVER[REMOTE_PORT] 的方法获取访客公网端口，可使用本服务曲线救国。由于使用了 CloudFlare 免费版本代理流量，本服务不保证获取到端口数据的准确性。 请求地址 https://api.licaoz.com/api/ip_port.php 请求方式 GET 返回信息 文本","link":"/post/api-server/"},{"title":"互联网冲浪新人避坑指南","text":"这几年看到了许多新手的离谱操作，貌似还没有查到专门的文章/教程指导如何避坑，那我就来开个头吧。 既然您能找到此篇文章，即证明您有最基本的使用搜索引擎的能力；我们将默认您计算机的系统已经完成安装。 连接网络 有线网络 如果您所在的环境（例如家里、公司）已有宽带等室内网络并有多余网口、网线，您可考虑使用有线网络连接互联网。 首先，确认你的设备所支持的网络接口；例如，台式机背部一般都拥有一个供网线水晶接头插入的接口——但有些笔记本设备需要自行购买拓展坞。 一般来说，接入物理网络后便可以访问互联网了——在极少数情况下还需要安装驱动，但您需注意的是部分局域网并未连接至互联网。关于更多内容，您可咨询您的网络管理员。 无线网络 首先，您需要拥有内置或外置无线网卡硬件以链接无线网络——同样的，如果您不了解您的设备，您可以向设备制造商询问。 鸽了。","link":"/post/guide-to-avoiding-pits-for-internet-surfing-newcomers/"},{"title":"如何用 GPG 加密你的数据&amp;验证身份？","text":"一篇 GPG 小白写给未使用过 GPG 的人们的使用指北。 什么是 GPG GNU Privacy Guard（GnuPG或GPG）是一个密码学软件，用于加密、签名通信内容及管理非对称密码学的密钥。[1] 我也不知道怎么更通俗易懂地解释这个东西 如何使用 GPG？ 笔者目前正在使用的环境为 Windows 11 专业工作站版 版本21H2 (OS内部版本2000.282)，以下内容不保证对其他版本系统兼容、不保证与后期软件兼容。 下载 Scoop 安装 运行 scoop install gpg 即可 安装 Gpg4win 根据官网介绍，Gpg4win 包含这些组件： 前往 官网 或从我分享的 蓝奏云(密码lcz.pub) 下载 一路 Next 即可 测试安装 新开一个 终端——记住一定要新开，否则 Path 未更新会提示 'gpg' 不是内部或外部命令，也不是可运行的程序 或批处理文件。 创建密钥对 以下步骤可在 Kleopatra 等前端 GUI 软件进行 咕了，有时间一定更新:) git config --global gpg.program “C:\\Program Files (x86)\\GnuPG\\bin\\gpg.exe”","link":"/post/gpg-encrypt/"},{"title":"中国科学技术大学第八届信息安全大赛 Write Up","text":"呼，居然没有掉出 400 名。 完结撒花！中国科学技术大学第八届信息安全大赛 正式结束啦。 排名 371 / 2677 后面的题都不会做 WWW 梗整理 梗图 梗 信息安全是一门 早睡早起/晚睡晚起/早睡晚起/一睡不起 的学科 中科大少年班学院的神童可以口算 RSA 题解 题解中部分题目需要使用 Token。Token 可以从比赛平台注册获取，也可以使用 1:MEQCIBY0ubN3BOXYsuRdXzqWIWNf8Jx0Y6giZCSp/Rg8zdNwAiBMZGWaiIGLD33KTfQ5TTLejp9PwGp8Gg4HsJbdo8sVig== 作为测试 Token。 今年只做出了签到、进制十六——参上、去吧！追寻自由的电波、猫咪问答 Pro Max、卖瓜、旅行照片、FLAG 助力大红包、图之上的信息；千言万语汇成一句话——我好菜啊我好菜啊我好菜啊。 签到 为了能让大家顺利签到，命题组把每一秒的 flag 都记录下来制成了日记本的一页。你只需要打开日记，翻到 Hackergame 2021 比赛进行期间的任何一页就能得到 flag！ 提示：完成题目遇到困难？你可以参考 2018 年签到题题解、2019 年签到题题解 和 2020 年签到题题解。 题目链接 传送门 打开题目，1970-01-01 08:00:00 +08:00给人的第一反应就是 UNIX 时间戳，别急，点击 Next 后网址带参 /?page=1，时间变为 1970-01-01 08:00:01 +08:00，证明就是 UNIX 时间戳咯。 随便找一个 UNIX 时间戳转换网站，把比赛时间（2021 年 10 月 23 日 中午 12:00 ～ 10 月 30 日 中午 12:00）中任意一天转换成时间戳如 1635177600 并替换 URL 中对应参数即可。 最后得到 Flag flag{HappyHacking2021-随机字符} 进制十六——参上 为严防 flag 泄漏以及其他存在于未来所有可能的意外灾难，神通广大的 Z 同学不仅强制要求每一道题目都加上权限和资源的限制，还给所有参与 Hackergame 2021 命题的计算机施加了一层法术结界。任何试图从结界逃逸的 flag 都会被无情抹除。 而一位明面上是计算机学院的新生，实则为物理学院暗部核心成员的 X 同学，在 Hackergame 2021 命题组已经潜伏多时。妄想趁比赛开始的午时，借阳火正旺之势，冲破 Z 同学的结界，以图片而非明文的形式，将 flag 悄悄传递出来。 好在 Z 同学法力之深厚，不可管窥蠡测。在 flag 被传出去的前两天，就已预知此事并将图片中的 flag 无声消泯了。 只是，这位 X 同学，虽然不会退出 Vim，但是似乎对打开十六进制编辑器颇有造诣…… 这道题题干通俗易懂，只需 随便找个十六进制编辑器 便可解决。 照着图片手敲十六进制也行，用 OCR 识别出来后直接粘贴到编辑器中也可。 最后得到 Flag flag{Y0U_SH0U1D_kn0w_H0W_t0_C0nv3rt_HEX_to_TexT} 去吧！追寻自由的电波 （前情提要）为了打破 Z 同学布下的结界，X 同学偷偷搬出社团的业余无线电台试图向外界通讯。 当然，如果只是这样还远远不够。遵依史称 “老爹” 的上古先贤的至理名言，必须要 “用魔法打败魔法”。X 同学向上级申请到了科大西区同步辐射实验室设备的使用权限，以此打通次元空间，借助到另一个平行宇宙中 Z 同学的法力进行数据对冲，方才于乱中搏得一丝机会，将 flag 用无线电的形式发射了出去。 考虑到信息的鲁棒性，X 同学使用了无线电中惯用的方法来区分字符串中读音相近的字母。即使如此，打破次元的强大能量扭曲了时空，使得最终接受到的录音的速度有所改变。 为了保障同步辐射设备的持续运转，组织牺牲了大量的能源，甚至以东北部分地区无计划限电为代价，把这份沉甸甸的录音文件送到了你的手上。而刚刚起床没多久，试图抢签到题一血还失败了的你，可以不辜负同学们对你的殷切期望吗？ 注：flag 花括号内只包含小写字母。 题目文件 下载 音频文件可自行调整倍速播放或稍微处理一下扔给 讯飞听见 语音转文本。 然后运用我们在小学二年级学过的无线电知识即可得出 Flag 字母 字母解释法 字母 字母解释法 字母 字母解释法 A ALFA B BRAVO C CHARLIE D DELTA E ECHO F FOXTROT G GOLF H HOTEL I INDIA J JULIET K KILO L LIMA M MIKE N NOREMBER O OSCAR P PAPA Q QUEBEC R ROMEO S SIERRA T TANGO U UNIFORM V VICTOR W WHISKEY X WHISKEY Y YANKEE Z ZULO 最后得出 Flag flag{phoneticab} 猫咪问答 Pro Max 我猛然一看，就猛然看到这个猫咪问答，我直呼我直呼，上次看到这么这么的发言还是上次，这问答属于是典型的典型了，我之前还没发现，当我发现的时候我已经发现了，这问答就像一个问答，问答的内容充满了内容，我不禁感慨了一句感慨：希望下次看到这么这么的猫咪问答是下次。 提示：解出谜题不需要是科大在校学生。解题遇到困难？你可以参考 2018 年猫咪问答题解 和 2020 年猫咪问答 ++ 题解。 题目链接 传送门 2017 年，中科大信息安全俱乐部（SEC@USTC）并入中科大 Linux 用户协会（USTCLUG）。目前，信息安全俱乐部的域名（sec.ustc.edu.cn）已经无法访问，但你能找到信息安全俱乐部的社团章程在哪一天的会员代表大会上通过的吗？ 去 互联网博物馆 输入信安俱乐部官网查看章程记录即可。 所以答案是 20150504 中国科学技术大学 Linux 用户协会在近五年多少次被评为校五星级社团？ 这问有选手 面向知乎编程，实际上 LUG 官网 就有～ 为了表彰其出色表现，协会于 2011 年 5 月被评为中国科学技术大学优秀学生社团，于 2012 年 5 月、2013 年 5 月及 2014 年 5 月分别被评为中国科学技术大学四星级学生社团，并于 2015 年 5 月、2017 年 7 月、2018 年 9 月、2019 年 8 月、2020 年 9 月及 2021 年 9 月被评为中国科学技术大学五星级学生社团。 记得题干问的是近五年，所以答案是 5 中国科学技术大学 Linux 用户协会位于西区图书馆的活动室门口的牌子上 “LUG @ USTC” 下方的小字是？ 在 LUG NEWS 中即可找到图片—— 结合提示 正确答案的长度为 27，注意大小写 得出答案为 Development Team of Library 在 SIGBOVIK 2021 的一篇关于二进制 Newcomb-Benford 定律的论文中，作者一共展示了多少个数据集对其理论结果进行验证？ 在搜索引擎上 搜索 可得到 这个 PDF 搜索 Newcomb-Benford 定位到论文，数一下图片可得出答案为 13 不严格遵循协议规范的操作着实令人生厌，好在 IETF 于 2021 年成立了 Protocol Police 以监督并惩戒所有违背 RFC 文档的行为个体。假如你发现了某位同学可能违反了协议规范，根据 Protocol Police 相关文档中规定的举报方法，你应该将你的举报信发往何处？ 稍微搜索一下，搜到了 这个 Wiki 词条； 在 这里 即可找到答案 126. Reporting Offenses Send all your reports of possible violations and all tips about wrongdoing to /dev/null. The Protocol Police are listening and will take care of it. 点击提交，得到 Flag 卖瓜 题目地址 传送门 本题考查 溢出 相关知识。 首先把这台反重力电子秤搞出一个负数 然后小心翼翼地加回正 20 …… 然后得到 Flag flag{HUAQIANG!HUAQIANG!_随机字符} 旅行照片 你的学长决定来一场说走就走的旅行。通过他发给你的照片来看，他应该是在酒店住下了。 从照片来看，酒店似乎在小区的一栋高楼里，附近还有一家 KFC 分店。突然，你意识到照片里透露出来的信息比表面上看起来的要多。 请观察照片并答对全部 5 道题以获取 flag。注意：图片未在其他地方公开发布过，也未采取任何隐写措施（通过手机拍摄屏幕亦可答题）。 题目地址 传送门 嗯？题目里为何强调 KFC？蓝色的 KFC？百度一下，确定目标——肯德基甜品站 (新澳海底世界店)（记住这个大众点评，待会还要用到） 然后即可通过地图软件确定方位、通过工商系统确定电话、通过影子确定时间、通过 某 方法判断楼层高度。 最后得出 Flag 为 flag{D0n7-5hare-ph0t05-ca5ua11y} ，不要经常分享图片。 出题人：主要是在提醒各位不要随随便便发自己的照片（Don’t share photos casually）——否则被人扒个底裤都不剩也只是分分钟的事。 FLAG 助力大红包 “听说没？【大砍刀】平台又双叒做活动啦！参与活动就送 0.5 个 flag 呢，攒满 1 个 flag 即可免费提取！” “还有这么好的事情？我也要参加！” “快点吧！我已经拿到 flag 了呢！再不参加 flag 就要发完了呢。” “那怎么才能参加呢？” “这还不简单！点击下面的链接就行” 题目链接 传送门 看到题目时我直接打开了我的 Burp Suite，设置代理抓包发送到 Intruder 一气呵成。 前端判定 IP 传送了个明文的 IP，后端判定 IP 估计使用了最常见的 X-Forwardrd-For ，一试果然是。 不过我干了件特 聪 bai 明 chi 的事情，我的 Payloads List 是手写的从 0.0.0.0 到 255.x.x.x 文件可以在 这里 看到。 之前没限制频率的时候总是返回长度 2335（频繁）还很慢，限制为 1200 毫秒就差不多啦。 一共 256 条 IP，提交完还剩好几分钟。 然后立即提现即可，Flag 为 flag{r3d-enve10p3-随机字符} 图之上的信息 小 T 听说 GraphQL 是一种特别的 API 设计模式，也是 RESTful API 的有力竞争者，所以他写了个小网站来实验这项技术。 你能通过这个全新的接口，获取到没有公开出来的管理员的邮箱地址吗？ 题目地址 http://202.38.93.111:15001 Burp 抓包发现查询指令是明文传输的，运用搜到的命令瞎拼乱凑出来一个查询 UserID 为 1 的用户的 privateEmail 的指令即可得到 Flag 本题无复现。 其他题目 请参考 官方题解 最后 好玩！明年见～","link":"/post/hackergame-2021-writeup/"},{"title":"如何完成在微信对公交卡的充值和线下圈存","text":"其实合川区的公交卡早就可以线上充值线下圈存了，但貌似很多同志不知道到底如何操作，故写此文。 在合川，可以线上充值公交卡早已不是件新鲜事；最早可追溯到的报道是2019年4月24日今日合川网的合川这20个公交站可充值IC卡 你学会了吗？ 在报道中提到的可圈存公交站有以下几个： 北城有瑞山路站、合州医院站、合川中学站、移通学院站、义乌小商品市场站、嘉陵路站、党校站、蟠龙花园站、杨柳街站、鹿角栅站、交通街站；南城有区政府站、南景豪爵站、南屏路站、合阳中学站、中什字站、中医院站、安太花园站、金鹿花园站。预计还会在城区铺设更多的圈存设备，目前还在进一步的规划中。 公交站台上已有较为详细的教程，此文章将更详细的说明。 下面我就来详细介绍一下如何充值、圈存。 首先，打开微信，点击首页右上角放大镜图标。 点击后，选择搜索指定内容-公众号 输入 交运通 三字，轻点键盘回车键。 结果第一个便是啦~ 现在服务号已经更名为 交运通卡 啦 新版微信可直接点击下方的在线充值，老版本微信请轻点卡片，进入公众号主页后点击在线充值，再点最上方的选项。 首次进入，需绑定IC卡，输入公交卡正面右上角数字与下方的验证码即可。 绑定完成后，大概是这样的(因为我是学生，所以是学生卡啦；卡号为什么这么多0？我也不知道~) 点击您要充值的卡片右边的&quot;在线充值&quot;按钮，即可进入在线充值页面。 进入此页面后，会显示您的卡类别、卡号与卡内余额（余额显示并非实时，但基本上是准确的）。 点选金额（或输入任意整数金额（可为1，但…拿来学生卡救急不错））后，点击下方的立即支付按钮，按照正常微信支付流程进行即可~ 支付完成后，资金会进入待圈存状态，您可点击充值页面的 最近支付记录 查看近期圈存成功的线上充值订单。 您需前往文章开头提到的任意一个公交站（一般位于站牌正面最右方）进行圈存，充值流程才算结束。 然后，愉快地刷卡吧","link":"/post/how-to-recharge-bus-card-online/"},{"title":"米表","text":"今天我又买什么垃圾域名了？ 排序不固定，想到那个排哪个。 域名 过期时间（并非全部为CST） 注册商 shiertx.com 2022年07月27日 Alibaba Cloud Computing (Beijing) Co., Ltd liczhi.com 2022年02月25日 Alibaba Cloud Computing (Beijing) Co., Ltd wdao.tech 2022年11月14日 DNSPod, Inc. 12-tx.cn 2022-01-26 19:39:54 阿里巴巴云计算（北京）有限公司 shiertx.tech 2022-01-17T23:59:59.0Z Dotserve Inc（Dot.Tech） softpc.cn 2022-08-14 18:39:36 广州云讯信息科技有限公司（腾讯云） antyun.host 2021-01-14T13:11:22.0Z DNSPod, Inc. hechuanwudao.com 2022-08-11T09:30:48Z DNSPod, Inc. hogwarts.asia 2022-07-31T13:39:49Z DNSPod, Inc. firedns.cn 2022-07-15 09:05:03 广州云讯信息科技有限公司（腾讯云） shieryun.com 2022-05-11T13:03:18Z DNSPod, Inc. threebody.asia 2022-08-03T07:16:19Z DNSPod, Inc. idc-blacklist.com 2022-07-16T04:44:20Z DNSPod, Inc. hczx.space 2022-09-20T23:59:59.0Z DNSPod, Inc. quarkdao.com 2022-10-07T06:23:46Z DNSPod, Inc. zhujiwuo.com 2022-04-02T15:37:10Z DNSPod, Inc. flags.asia 2022-10-28T12:47:20Z DNSPod, Inc. 一流中学.com 2022年08月15日 DNSPod, Inc. lcz.pub 2022-10-24 (UTC) 烟台帝思普网络科技有限公司 limou.ren 2022-11-04 (UTC) 烟台帝思普网络科技有限公司 mirrors.asia 2022-10-17 (UTC) 烟台帝思普网络科技有限公司 wdc.asia 2022-11-12 (UTC) 烟台帝思普网络科技有限公司 wdao.tech 2022-11-13 (UTC) 烟台帝思普网络科技有限公司 shiertx.cn 2022-01-21 21:07:34 阿里云计算有限公司（万网） licaozhi.com 2022年06月12日 Xin Net Technology Corporation licaozhi.cn 2022-06-12 16:58:52 北京新网数码信息技术有限公司 cqhczx.com 2022年04月09日 DNSPod, Inc. 亚洲一流中学.asia 2022年08月15日 DNSPod, Inc. cloud-collector.com 2022年07月20日 DNSPod, Inc. supersign.asia 2022年07月07日 DNSPod, Inc. coolq.zone 2022年05月19日 DNSPod, Inc. 如果看上除了第一个的哪个可以邮件联系我，价钱好商量，主要是续不起了想回回血呜呜呜。","link":"/post/mibiao/"},{"title":"[置顶]初三化学笔记","text":"初三化学方程式笔记 九上 人民教育出版社 / 2021年7月重庆第10次印刷 / 978-7-107-24501-5 应该可能也许大概都是已经配平了的，吧。 蜡烛燃烧 第一次出现在 P13 $$石蜡 + O_2\\stackrel{点燃}{\\longrightarrow}CO_2 + H_2 O$$ 读作：石蜡和氧气点燃生成二氧化碳和水。 不过石蜡这种混合物怎么配平啊 磷燃烧 第一次出现在 P27 适用于红磷、白磷 $$4 P + 5 O_2\\stackrel{点燃}{==}2 P_2 O_5$$ 实验现象： 红磷燃烧发出黄色火焰，产生大量白烟，放出大量的热 冷却到室温后打开弹簧夹，水顺着导管进入集气瓶，约占集气瓶体积的五分之一 读作：磷和氧气点燃生成五氧化二磷。 硫燃烧 第一次出现在 P33 注意事项：二氧化硫为有毒气体。 $$S + O_2\\stackrel{点燃}{==}SO_2$$ 特性：可以说这个化学反应中反应物的质量比是1:1 实验现象：剧烈燃烧，发出明亮的蓝紫色火焰。放热，生成有刺激性气味的气体。 读作：硫和氧气点燃生成二氧化硫。 碳燃烧 第一次出现在 P34 / P110 如果氧气充足(P34/P110)： $$C + 2 O_2\\stackrel{点燃}{==}C O_2$$ 实验现象：剧烈燃烧，发出白光，放出热量，生成能使澄清石灰水变浑浊的气体。 读作：碳和氧气点燃生成二氧化碳。 如果氧气不充足(P110)： $$2 C + O_2\\stackrel{点燃}{==}2 CO$$ 特性：不充分燃烧生成的一氧化碳具有碳的全部性质。 读作：碳和氧气点燃生成一氧化碳。 铁(丝)燃烧 第一次出现在 P34 $$3 Fe + 2 O_2\\stackrel{点燃}{==}Fe_3 O_4$$ 实验现象：剧烈燃烧，火星四射，放出大量的热，生成黑色固体。 读作：铁和氧气点燃生成四氧化三铁。 制取氧气 高锰酸钾制氧气 第一次出现在 P37 注意事项：加热高锰酸钾粉末制取氧气需要在试管口放一团棉花防止加热时高锰酸钾粉末顺导管进入集气瓶影响氧气纯净度，如果不塞棉花你可能会收集到一瓶黑色的氧气。 $$2 KMnO_4\\stackrel{加热}{==}K_2MnO_4 + MnO_2 + O_2↑​$$ 读作：高锰酸钾加热生成锰酸钾和二氧化锰和氧气。 过氧化氢制氧气 第一次出现在 P39 注意事项： 本反应需要二氧化锰作催化剂加速反应进行 本实验中，二氧化锰作为催化剂质量没有减少，这是催化剂“一变二不变”（即能改变其他物质的化学反应速率，本身的质量和化学性质不变）的特点之一 此实验为“固液常温型”，即反应物为固体和液体混合、反应可在常温下进行；此实验所需要的器材一般为漏斗（液）+锥形瓶（固）+导管，注意与其他两种固固加热型反应的器材区分 $$2H_2 O_2\\stackrel{二氧化锰}{====}2H_2 O + O_2↑​$$ 咕咕咕咕咕咕","link":"/post/middle-school-chemistry-notes/"},{"title":"初中物理电学笔记","text":"部编版初三全一册物理 第十五章 电流和电路 笔记 第一节 两种电荷 物体只要带电，就能吸引轻小物体。 吸引时两种物体带异种电荷或其中一个不带电。 两种电荷 摩擦起电 用摩擦的方法使物体带点，叫做摩擦起电。除此之外，还有接触起电和感应起电。 正负电荷 自然界只有两种电荷。 人们把用丝绸摩擦过的玻璃棒带的电荷叫做正电荷，用毛皮摩擦过的橡胶棒带的电荷叫做负电荷。 记忆方法：丝玻正，毛橡负。 同种电荷互相排斥，异种电荷互相吸引。 记忆方法：同斥异吸 电荷量 物体所带电荷的多少叫做电荷量，简称电荷，电荷量用字母表示为Q或q；电荷量的单位是库仑，简称库，符号是C。 验电器 验电器的作用：检验物体是否带电；原理：同种电荷互相排斥。 绝缘垫用于隔绝金属杆与金属外壳。 除图中已标注部分外，还有接地和外侧的金属外壳。 用带电体接触验电器的金属球，就有一部分电荷转移到验电器的两片金属箱上，这两片金属箔带同种电荷，由于互相排斥而张开。 易错辨析：正电荷在固体导体中的位置是相对固定的，能移动的是其内部的自由电荷。 使用验电器检验物体带电类型 使用一个已知带电类型的带电体（例如用丝绸摩擦过的玻璃棒或者用毛皮摩擦过的橡胶棒）接触验电器，再使用待测带电体接触验电器。 如果张角不减小而直接增大表明与前一步带电体带同种电荷；如果张角缩小但还未关闭表明与 咕咕咕，逐步完善中","link":"/post/middle-school-physics-electrical-notes/"},{"title":"Office LTSC 专业增强版 2021 食用指南","text":"装完 Windows 11 后心血来潮想装一个 Office LTSC 专业增强版 2021，开搞！ 下载 OTP 想办法下载一个 Office Tool Plus，可选 官网通道 / 云图下载站 / ODB / GitHub Releases &amp; 东大镜像，推荐使用前三项以跳过安装 OTP 运行环境。 下载之后，随便解压到一个目录去。 安装 Office LTSC 专业增强版 2021 然后双击运行 Office Tool Plus.exe ，点击 安装 Office 后选择 Office LTSC 专业增强版 2021 - 批量许可证。 点击 是，等待安装。 安装完成后，打开任意 Office 组件，产品信息一栏应该会提示 请连接至组织激活服务器。 不要惊慌，回到 OTP 主页，点击 激活。 安装密钥 Office LTSC 2021系列版本GVLK通用密钥： 转自 https://www.landian.vip/download/91008.html GVLK即通用密钥，以下密钥均为微软公开密钥不涉任何版权问题，以下密钥仅用于企业KMS激活无法直接使用。 版本名称：Office LTSC Professional Plus 2021 GVLK密钥： FXYTK-NJJ8C-GB6DW-3DYQT-6F7TH 版本名称：Office LTSC Standard 2021 GVLK密钥： KDX7X-BNVR8-TXXGX-4Q7Y8-78VT3 版本名称：Project Professional 2021 GVLK密钥： FTNWT-C6WBT-8HMGF-K9PRX-QV9H8 版本名称：Project Standard 2021 GVLK密钥： J2JDC-NJCYY-9RGQ4-YXWMH-T3D4T 版本名称：Visio LTSC Professional 2021 GVLK密钥： KNH8D-FGHT4-T8RK3-CTDYJ-K2HT4 版本名称：Visio LTSC Standard 2021 GVLK密钥： MJVNY-BYWPY-CWV6J-2RKRT-4M8QG 版本名称：Access LTSC 2021 GVLK密钥： WM8YG-YNGDD-4JHDC-PG3F4-FC4T4 版本名称：Excel LTSC 2021 GVLK密钥： NWG3X-87C9K-TC7YY-BC2G7-G6RVC 版本名称：Outlook LTSC 2021 GVLK密钥： C9FM6-3N72F-HFJXB-TM3V9-T86R9 版本名称：PowerPoint LTSC 2021 GVLK密钥： TY7XF-NFRBR-KJ44C-G83KF-GX27K 版本名称：Publisher LTSC 2021 GVLK密钥：2MW9D-N4BXM-9VBPG-Q7W6M-KFBGQ 版本名称：Skype for Business LTSC 2021 GVLK密钥： HWCXN-K3WBT-WJBKY-R8BD9-XK29P 版本名称：Word LTSC 2021 GVLK密钥： TN8H9-M34D3-Y64V9-TR72V-X79KV 激活 在 KMS 管理 =》KMS 主机 一栏中填入 零散坑 大佬的 KMS ——kms.03k.org ，保存设置后点击 激活 即可。 再打开任意 Office 组件，应该会显示 产品已激活。 欣赏一下优雅的启动动静画","link":"/post/office-ltsc-pro-plus-2021/"},{"title":"红米10X 4G版玩机攻略","text":"URL 中的英语是 Google 生草机 的杰作，I don’t think that is right。 本文所写内容适用于小米产品代号为 merlin 的设备，亦可能部分适用于其他设备。 刷入 Magisk 作为一个“稳定版”用户，直接通过系统内一键 root 显然是行不通的了，不过我们可以玩迂回战术。 需要的文件 想办法下载到你现在设备正在使用的版本的系统的卡刷完整包——线刷包可应该可能大概也许可以，把 boot.img 和 vbmeta.img 粘出来。 你需要有一个支持高级参数的 fastboot.exe，可以在 这里 下载到 wzsx150 大佬的一键刷入工具使用里面的fastboot。 你大概需要安装一个驱动，直接使用 VIVO刷机驱动 即可。 把粘出来的 boot.img 扔到手机 Magisk 修补一下然后再粘回电脑。 下面默认已将修补后 boot 文件命名为 boot.img 并和 vbmeta.img 一起放在在解压了w大工具的文件夹。 刷入IMG 先从正常模式重启到 FASTBOOT：adb reboot bootloader 然后检查一下是否已正确连接并安装驱动：fastboot devices 确认无误后刷入BOOT：fastboot flash boot boot.img 然后刷入取消强制验证的VBMETA：fastboot --disable-verity --disable-verification flash vbmeta vbmeta.img 重启：fastboot reboot","link":"/post/redmi-merlin-play-machine-strategy/"},{"title":"常用投诉举报联系方式","text":"本文摘自知乎答主 @Firefly 的 回答，感谢答主收集~ 市长热线（信访） 12345 纪律检查委员会 12388 组织部 主要受理反映违反干部选拔任用工作政策法规选人用人，以及领导干部政治、思想、作风、廉洁自律等方面问题的举报。 12380 环保热线 环保热线将做到24小时畅通，执法队伍接到举报迅速出动，及时处理环境违法案件，接受社会检验。 社会各界及广大群众在向环保部门举报环境污染问题时，可根据环境污染事件的发生地点向辖区环保局或“12369”市指挥中心举报。 12369 检察服务中心 反映侦查机关侦查活动存在违法行为的控告。 反映人民检察院工作人员违法违纪行为的控告。 不服人民检察院处理决定的申诉。 不服人民法院生效判决、裁定的申诉。 公民、法人或者其他组织提出的国家赔偿申请。 刑事被害人或民事被侵权人及其近亲属提出的司法救助申请。 加强、改进检察工作和队伍建设的建议和意见。 案件程序性信息查询、法律咨询。 投案自首。 其他依法应当由人民检察院处理的信访事项。 12309 未整理 社保局12333，欠薪办12351，物价12358，食药局12331，人民银行12363，商务12335，税务12366，司法12348，外交12308，文化12318，文物12359，邮箱（网络不良垃圾信息）12321，运输12328，知识产权12330，质检12365，海关12360，国土12336，公积金12329，烟草12313，保监会12378，铁路12306，农业信息12316，国家扶贫办12317，城市服务12319，防震减灾12322，妇联12338，间谍举报12339，城管12342，民政12349，安全生产12350，工会12351，残联12385，证监会12386，电力12398。 公安部 举报电话公安部网络违法案件举报网站为 http://www.cyberpolice.cn公安部公安民警违法违纪举报电话 010-58186696公安部经济犯罪举报中心 010-66266833公安部扫黄打非举报电话 010-58186722公安部打拐 举报电话 010-84039250公安部全国扫黄打非工作小组办公室举报电话 010-65212870公安部禁毒热线（国家禁毒委员会） 010-66266611公安部打击赌博违法犯罪活动专项行动举报电话 010-58186722公安部打黑除恶举报电话 010-66264666----------------------------------------【中央媒体电话】中央电视台 通信地址北京复兴路11号中央电视台，邮编100859中央电视台《焦点访谈》010-68579889中央电视台《东方时空》010-68508738中央电视台《实话实说》010-63984662中央电视台《面对面》 010-63984655中央电视台《新闻调查》010-68579889转198中央电视台《今日说法》010-68579889-166凤凰卫视北京总机 010-68977288人民日报新闻线索 010-65368383解放日报新闻热线 021-63523600新华社新闻热线 010-63073111/63073222/63076206/63074267-------------------------------【中央部门举报电话】中组部反映违反选人用人方面的问题 举报电话 12380检检察机关超期羁押 举报电话 010-68650468/65252000群众举报职务犯罪 举报电话 010-65252000减刑/假释/保外就医专项检查活动 举报电话电话 010-68650468国家发改委教育乱收费举报电话 010-68502937/66096145国家发改委重大建设项目违规 举报电话 010-68501111农民工工资拖欠问题举报电话 010-68304532国土资源部中国土地矿产法律热线 16829999国土资源部全国建设系统服务热线 12319水利部水利工程建设举报 010-63205050农业部 农业安全生产事故和紧急事件 举报电话 010-64192512中国消协农机产品质量投诉站投诉 010-67347472消费者申诉 举报电话 12315农业部种子案件 举报电话 010-64192079/64194511农业部农药案件举报电话 010-64192810/64194066统计局统计违法举报电话 010-68573311转88123审计署 水利建设资金举报 010-68301241/68301802（自动传真)税务总局 税务违法案件举报电话 010-63417425/63543740/63417436 传真010-63543711电监会电石/铁合金和焦炭行业用电及执行电价情况监督 举报电话 010-66597385/66597388国家旅游局受理投诉电话 010-65275315国家劳动与社会保障部咨询举报电话 010-84220843/84201672----------------------------------------【其它类举报投诉电话】 中组部反映违反选人用人方面问题的举报：区号＋12380 高检检察机关超期羁押举报：010-68650468／010-65252000 高检群众举报职务犯罪：010-65252000 高检减刑、假释、保外就医专项检查活动举报：010-68650468 国家发改委教育乱收费举报：010-68502937 ／010-66096145 国家发改委重大建设项目违规举报：010-68501111 公安部经济犯罪举报：010-65204333 公安部打拐举报：010-84039250 水利部水利工程建设举报：010-63205050 公安部扫黄打非举报：010-65254722 消费者申诉举报：12315 统计局统计违法举报:010-68573311转88123 审计署水利建设资金举报：010-68301241、 010-68301802（自动传真) 税务违法案件举报：010-63417425、010-63543740、010-63417436 电监会电石、铁合金和焦炭行业用电及执行电价情况监督举报：010-66597385、010-66597388 职务犯罪举报：12309 消费者投诉热线 12315 价格投诉热线 12358 质量投诉 12365 环保投诉 12369 税务投诉 12366 电信投诉 12300 市长热线 12345 公共卫生监督 12320 妇女维权 12338 服务类电话 银行服务 工商银行 95588 建设银行 95533 农业银行 95599 中国银行 95566 交通银行 95559 浦发银行 95528 民生银行 95568 兴业银行 95561 中信银行 95558 深圳发展银行 95501 华夏银行 95577 招商银行 95555 广发银行 95508 光大银行 95595 保险服务 生命人寿95535 中国人保 95518 中国人寿 95519 太平洋保险 95500 中国平安保险集团 95511 新华人寿保险 95567 泰康人寿保险 95522 医疗保险查询 96102 交通服务 铁路 12306 国航 4008100999 海航 950718 南航 4006695539 东航 95530 深航 4008895080 厦航 95557 山航 4006096777 神州租车 4006166666 一嗨租车 4008886608 易到租车 4001111777 快递服务 申通快递 4008895543 EMS 4008100999 顺丰速运 400-811-1111 圆通速递 021-69777888 中通速递 021-39777777 韵达快运 021-39207888 天天快递 021-67662333 汇通快运 021-62963636 速尔快递 4008822168 德邦物流 95353 宅急送 4006789000 中铁快运 95572 通讯服务 中国移动 10086 中国联通 10010 中国电信 10000 中国网通 10060 中国铁通 10050 中国邮政 11185 查号台 114 移动信息查询 12580 联通114 116114 电信114 118114 电话障碍申告台 112 中国电信IP接入号 17900 联通IP接入号 17910 移动IP接入号 17951 网通IP接入号 17960 铁通IP接入号 17990 联通长途接入号 193 网通长途接入号 196 铁通长途接入号 068 网购服务 淘宝网 0571-88158198 京东商城 4006065500 当当网 4007116699 卓越网 4008105666 拍拍网 0755-83762288 凡客诚品 4006006888 拉手网 4000517317 美团 4006605335 24券 4006662424 糯米网 4006500117 满座网 4006858666 窝窝团 4001015555 售后服务 苹果 4006668800 诺基亚 4008800123 三星 4008105858 摩托罗拉 8008105050 索爱 4008100000 联想 8008108888 戴尔 8008580888 索尼 8008209000 飞利浦 8008201201 松下 8008100781 东芝 8008108208 TCL 4008123456 其他服务 天气预报 12121 供电服务热线 95598 报时台 12117 国土资源部中国土地矿产法律热线：16829999 国土资源部全国建设系统服务热线：12319 法律援助 12348 劳保政策咨询 12333","link":"/post/reports-contact-info/"},{"title":"今天，分享一首歌","text":"我们星辰大海肩并肩 自古英雄出少年 坚定信念 勇往直前 强国有我 好少年 最近团团真是高产哦…… 祖国有我貌似被扬了 新歌 强国少年，歌手全国少工委、四川省少先队员代表 共青团中央。 歌词 [00:00.000] 作词 : 隋佶辰/姜丽萍 [00:01.000] 作曲 : 隋佶辰 [00:31.950] 少年郎 志四方 [00:35.873] 阳光照耀着我成长 [00:39.600] 好好学习 奋发向上 [00:43.660] 报效祖国 做栋梁 [00:47.557] 乘着风 迎着光 [00:51.551] 追逐梦想 勇敢去闯 [00:55.382] 阳光少年 激情飞扬 [00:59.417] 强国有我 少年郎 [01:02.774] 我们星辰大海肩并肩 [01:07.282] 自古英雄出少年 [01:11.216] 坚定信念 勇往直前 [01:15.154] 强国有我 好少年 [01:18.867] 我们星辰大海肩并肩 [01:23.031] 自古英雄出少年 [01:26.968] 坚定信念 勇往直前 [01:30.879] 强国有我 好少年 [01:50.573] 少年郎 志四方 [01:54.417] 阳光照耀着我成长 [01:58.429] 好好学习 奋发向上 [02:02.377] 报效祖国 做栋梁 [02:06.228] 乘着风 迎着光 [02:10.167] 追逐梦想 勇敢去闯 [02:13.983] 阳光少年 激情飞扬 [02:18.078] 强国有我 少年郎 [02:21.755] 我们星辰大海肩并肩 [02:25.935] 自古英雄出少年 [02:29.945] 坚定信念 勇往直前 [02:33.842] 强国有我 好少年 [02:37.254] 我们星辰大海肩并肩 [02:41.749] 自古英雄出少年 [02:45.687] 坚定信念 勇往直前 [02:49.475] 强国有我 好少年 [02:53.416] 少年智则国智 [02:55.464] 少年强则国强 [02:57.394] 新时代的好少年 [03:01.307] 少年智则国智 [03:03.362] 少年强则国强 [03:05.362] 强国有我好少年 [03:09.204] 少年智则国智 [03:11.198] 少年强则国强 [03:13.250] 新时代的好少年 [03:16.943] 少年智则国智 [03:19.186] 少年强则国强 [03:20.984] 强国有我好少年 站内播放器","link":"/post/share-song-20211115/"},{"title":"社群危机（自杀）干预手册（持续更新）","text":"本文转载自知乎专栏文章：社群危机（自杀）干预手册（持续更新），作者寒涟漪。 什么人更容易得抑郁症？这个问题没有明确的答案，但以下均为抑郁症高发人群： 如果一个人的父母、子女或同父母的兄弟姐妹中有人得过抑郁症，那么这个人得抑郁症的可能性比其他人要高出2~10倍。 经历过创伤性事件的人，比如性侵、霸凌、自然灾害、意外事故等。 性格比较内向、敏感、悲观、自卑的人。 长期处于压力和紧张的氛围中，并且情绪无法得到疏解的人。 有其他严重的疾病尤其是脑部疾病的人。 很多抑郁症患者会有自杀的想法，但这绝对不是因为他们意志薄弱或想要博得关注，而是因为决策能力下降、行事容易冲动，或者被情绪反复及躯体症状折磨得生不如死。 抑郁症想自杀是生理原因导致的，不是真实想法，如果患上抑郁症，你的大脑会产生脑部病变，停止分泌多巴胺。即使你的现实生活很美满，很幸福，你也会想自杀。假设，你在明知道你自杀会给你爱人造成打击的情况下，并且现实中没有任何让你不顺心的事情，但只要你患有抑郁症，你就会选择自杀 抑郁症的典型特征：没有理由的情绪低落，没有理由的想死。 即使有理由，也是非常小的理由，例如：今天被一个人嘲笑了，所以我还是自杀吧，死了就不会有人嘲笑我了。 抑郁症的自杀思维途径是：抑郁症→无缘无故想自杀→寻找自杀的理由→自杀 普通人的自杀思维路径则是 遭受挫折→因为挫折想自杀→自杀 所以抑郁症必须就医，不是靠“安慰一下”“打开心结”就能解决的。 是脑子出问题了，神经递质罢工了，多巴胺不分泌了，根本原因不是心理上的问题 治好抑郁症，需要心理治疗＋吃精神药＋物理治疗。 每个人都有求生本能，当这一本能被扑面而来的绝望感淹没，逼你放弃自己的生命时，希望你能够做到以下几点： 不要独处，尽量去人多的地方。 找一些事情转移自己的注意力，不要一直陷在“自杀”这件事里。 如果还是无法摆脱自杀的冲动，就去找一个你信任的人，让他寸步不离地陪伴你。 如果以上方法都无法打消你的自杀念头，就必须去医院了，通过住院或者电休克疗法快速摒除自杀的冲动。 一个人无论何时具备以下危险因素中的4~5项，都可被视为处于自杀的高风险期： 有自杀家族史。 有自杀未遂史。 已经制订了具体的自杀计划。 最近经历了心爱之人去世、离婚或分居。 最近由于经济损失或受虐而导致家庭不稳定。 陷入巨大的创伤而难以自拔。 有精神疾病。 有药物或酒精滥用史。 最近遭受了躯体或心理创伤。 有失败的医疗史。 独居，而且与他人失去联系。 有抑郁症，目前处于抑郁症的恢复期或正在住院治疗。 在分配个人财产或安排后事。 有特别的情绪和行为改变，比如冷漠、退缩、隔离、易怒、恐慌、焦虑等，或者社交、睡眠、饮食、学习、工作习惯发生改变。 有严重的绝望感或无助感。 陷入经历过的躯体、心理或性虐待中不能自拔。 有愤怒、攻击性、孤独、内疚、敌意、悲伤或失望等情感表达。 值得注意的是，自残并不一定是自杀的征兆，虽然自残和自杀有一些相同的原因，比如： 逃避难以承受的痛苦。 改变他人对自己的看法。 缓解紧张、焦躁的情绪。 寻求他人的帮助。 任何人都可能会产生自杀的念头，如果你认为某人有自杀倾向，你应该直接询问那个人，比如： 你有自杀的想法吗？ 你想自杀吗？ 切记，不能以高人一等的态度或者命令式的口气，也不应该有先入为主的倾向。像“你是不是想做傻事呀？”这样的表述比较平易近人，有自杀想法的人可能不会过于排斥。 有些人可能会觉得，这种直接询问的做法会强化对方自杀的想法。但研究表明，如果一个人有自杀倾向，直接询问不会增加他们的自杀风险。相反，这样问实际上给了他们一个解决问题的机会，并让他们知道有人在关心他们。 当有人告诉你他想自杀的时候，你可能会感到震惊和焦虑，这是可以理解的。但你需要避免做出消极的反应，而是要表现出冷静、自信和富有同情心的样子。 你可以使用的交谈技巧包括： 不要回避使用“自杀”一词，直接讨论这个问题是很重要的。 说一些真正关心对方的话比说你应该怎样做更有效。你需要理解、支持有自杀想法的人，还需要全神贯注地倾听他们的话。 问一问他们在想什么，有什么感受。 你要让他们安心，向他们表示你愿意听他们说任何想法和感受，以及他们想死的原因。 让他们知道，可以把这些事情说出来，即使过程可能很痛苦。 允许他们自由表达自己的情感，比如尽情哭泣、发泄愤怒，甚至是大声咒骂。 感谢他们愿意分享自己的感受，并告诉他们这样做是有勇气的表现。 倾听的过程中需要保持耐心和冷静，平静而共情地倾听。 不轻易同意或者否定他们的态度、行为、观点，让他们自由地表达 提出开放式问题，这样才能问他们更多问题，从而发现隐藏在自杀念头背后的信息。 以总结的方式表明你确实在倾听他们，比如，“你想表达的就是……吗？” 通过对话，找出其中的重要信息，评估危险程度。 询问既往史（有无自杀未遂） 分析除自杀之外还可能发生的事情。 询问其自杀计划。 时时刻刻表现出同理心，同情并给予支持。 例如，危机干预中你可以说的语句： 对于发生在你身上的事情，我觉得很难过 你现在安全了。（如果这个人确实是安全的） 我很高兴现在你和我一起在这里/你正在和我说话。 这不是你的错。 你的反应是遇到不寻常事件的正常反应。 你有这样的感觉是正常的。 看到/听到/感受到这些一定让人难过/痛苦。 你不会发疯的。 事情不会一直这样的，它会变得更好，而你也可以变得更好。 你的想象会造成一个比事情原本的样子更加可怕的现实。 哭泣，憎恨，想报复都是没关系的。 你应该做的事情： 达成协议以拖延时间。 参与其他支持（如家庭干预，经济支持）。 如可能，转移自杀工具。 采取行动，告知他人，得到帮助（如果没有能力独立干预，可以将对方危机干预的任务转介给其他人） 如果自杀风险很高则始终陪伴当事人（如条件允许，现实陪伴效果最佳，退而求次则网络陪伴） 如果自杀风险很高，切勿让其独处。 尽管交谈很重要，但仍有很多事情是不适合说或者做的，比如： 与他就自杀的想法进行辩论，进行空洞的说教。 与他讨论自杀是对还是错。 用愧疚感或威胁来阻止他自杀（比如，告诉他这样做会毁掉他的家庭等）。 弱化他提出的问题，对事态严重性的认识不足，认为当事人的问题微不足道。 频繁并且单一的给对方敷衍的安慰。比如，“别担心”，“振作起来”，“你什么都有了”或者“一切都会好起来”。 用你自己的故事来打断他的话。 通过肢体语言表达你对某件事不感兴趣或态度消极。 试图给他做精神疾病诊断。 对对方诉说的事情表现出震惊、困窘、惊恐。 刺激当事人加速实行自杀。 给予对方虚假的承诺，例如： 承诺对方实施自杀行为时，绝对不会报警。 承诺自己会给予对方自己无法给予的帮助。 当对方自杀风险很高的时候，现实中选择离开当事人让其独处。 同时，危机干预中你不可以说的语句： 我知道你的感觉是什么/我了解（应当直接完整复述对方遇到的困难和想法，达成共情，而不应当省略）。 不会有事的，所有的事情都会没有问题。（这句话无法消除对方内心的恐慌与恐惧） 你不应该有这种感觉。（认为当事人的困难微不足道） 当对方重要的人离世时，你不应该说： 你能活下来就是幸运的了 你能救回些东西算是幸运的了 你是幸运的，你还有其他孩子/亲人/朋友。 你爱的人在死时并没有受到太多痛苦。 他/她死之前已经过了幸福的一生。 他/她现在去了更好的地方/更快乐了。 你会走过来的，时间会治疗一切的创伤。 你应该回到你的生活中正常生活下去。 网络自杀干预注意事项： 报警怎么报？ 电话报警 拨110陈述事实之后，民警会告诉你要报给自杀者所在地的公安，直接拨110拨到的只是本地的；拨给自杀者所在地公安应该是110前加区号，各地区号现在网络上也是能查询到了。例如北京110则是拨打010110 报警后向民警提供对方你知道的所有相关信息（如果一个信息无法确定真实性则不提供），如身份证号，身份证姓名，身份证性别，电话号码，住址，社交关系，亲属联系方式，微信号，QQ号，工作单位，学校等，有多少信息给多少信息。 如果是跨性别者则向警察额外说明对方的生理性别，并且把对方打扮成了另一个性别的情况说明，例如：这是个男孩，但是喜欢把自己打扮成女孩。（危急时刻不要和民警纠结跨性别的概念！） 即使只有一个QQ号或者微信号也可以向民警报警，在警察面前，所有的网络信息都是透明的。但是需要注意的是，信息越少民警找人花费的时间就越久甚至可能放弃找人，所以一般情况下信息越全越好。 （极少部分情况下）如果民警质问：只有一个QQ号/微信号不知道地址姓名我们怎么找人？则可以向对方表示要求对方使用数据手段进行干预，和对方说“我已经和本地公安报过警，对方说只需要提供QQ/微信号就可以了”。 微信报警 现在各地区都有自己的公安微信公众号，可以直接在公众号（注意是自杀者所在地的公安微信公众号）上报警，要填写相关信息。最好把宣告自杀的帖子截图下来，在提供图片那一栏里发上去；电话号码也会要求提供（往往是需要短信验证码验证后才能报案） 微信报警之后不久，就会接到警察的来电，详细核实所给的信息，但是也会问你的包括身份证号在内的个人信息！ 出警到地方之后一般会再打一通核实一遍相关信息。 报警的后果 来自自杀者的麻烦：报警只能救到这一次，若是无法提供后续的心理治疗服务，则还是会不断的再次自杀，同时一个人自杀未遂的次数越多，那TA下一次自杀成功的概率和尝试自杀的频率往往也会越来越高。 由于没得到相关心理治疗，自杀者往往会忌恨报警者（以及警察）。 什么时候应该报警 报警具有极大的风险性，不到非常危机的时刻或者是恰当的情况下不要轻易报警，否则极有可能适得其反。 当对方表现出极为明确的即将实施自杀行为的想法，又失联的情况下；例如QQ/微信信息不回复，电话不接，斟酌实际情况报警。 当对方已经实施自杀行为时必须报警。 当对方正在遭遇严重侵害时（如家庭矛盾），斟酌实际情况报警。 当对方正在实行高人身安全风险行为时，斟酌实际情况报警。 是否休学或辞职，应该从我们自身的病情考虑，疾病的严重程度是最重要的判定因素。抛开疾病的严重程度谈休学或辞职，都是对病情、对自己、对未来不负责任的表现。 第一，要积极治疗 血的事实告诉我们，抑郁症必须治疗。许多患者的亲朋好友认为，抑郁症只是心理、情感问题，只要谈谈话，疏导疏导，“打开心结”，就能“走出来”。这实在是不懂科学的表现。 因为研究显示，抑郁症是一种生理性的疾病，尤其是中度、重度抑郁症患者，绝大多数已经产生了脑部病变。 至于患者本人，得了抑郁症，起先不自知；捱了很多时日，才会犹犹豫豫走上求治之路。那时他心理准备不足，当医生告诉他，疗程很长，至少半年以上，甚至两年、三年，还要不断复诊、复查，他就会畏难、绝望、抗拒，经常不能坚持治疗，最终酿成悲剧。 一旦发现自己得了抑郁症，不要犹豫，立刻去正规的精神科医院；根据自己的病情程度，请医生决定，是吃药，还是看心理医生。不要浪费宝贵的时间。在抑郁症早期，时间就是生命。 第二，干预抑郁症患者自杀，最关键的是判断患者何时最有可能自杀 自杀分三个步骤：自杀意念、自杀企图、自杀实施。几乎每个抑郁症患者都会有意念和企图，但要走到实施这一步，还需要客观条件。 依据抑郁症临床症状表现，医学上把抑郁症分类为轻度、中度和重度三种类型。 轻度抑郁症患者心境低落，兴趣和愉快感丧失，容易疲劳，多思多虑，自卑消极，无缘无故出现多种躯体不适； 到了中度，还会追加脑功能阻滞和精神运动性阻滞，患者感到自己大脑思维功能、行动功能和社会功能下降，不敢见人，人际交往发生障碍； 到了重度，患者情绪极为抑郁，已无法感知喜怒哀乐，思维动作严重迟缓，语速慢，语音低，语量少，应答迟钝，严重者可呈木僵状态。一天之内，经常不言不语，不动不吃。 那么，是不是重度抑郁症自杀危险最大？ 不是。这正是抑郁症的独特之处：抑郁症患者自杀，往往发生在从轻度向中度恶化，以及从重度向中度好转的阶段。真正的重度抑郁症患者自杀的概率相对较低。 原因是，抑郁症药物治疗的特点是：先改善患者的动力，后改善患者的情绪。自杀要具备两个条件，即自杀的意愿和执行的动力。 重度患者往往大脑一片空白、体力不支，不具备自杀能力；而药物一旦起效，患者大脑的抑制先得以解除（有了动力），可是情绪的好转要落后一周（自杀意念还在），自杀往往在这一阶段发生。 这也是为何，部分中度和重度抑郁症患者在接受药物治疗以后，在数周内自杀率反而上升。 也许患者再坚持一两天，就能挣脱黑暗，迎来光明。但是，他看不见曙光在前，放弃在最后一刻，功亏一篑。 痛苦是很难杀人的，绝望才是真正的杀人元凶。 干预自杀，就要学会识别患者从轻度向中度恶化、尤其是从重度向中度好转的关口。在这两个时段，要把病人看好，最好寸步不离。一旦出现闪失，后悔莫及！ 如果病人吃药一个月，一直情绪状态没有好转，但是忽然开始闹事，拒绝吃药，情绪激动 这说明患者有力气闹，可能药要见效了。如果病人闹，由他闹，不用劝解，只需做好两件事：一是督促他每天吃药，一粒不能少；二是把家里的阳台、窗户封好，寸步不离人。 意志比较坚强的患者，则要有自我拯救意识。自杀往往发生在一念之间，很多时候仅靠意志难以抵抗自杀的冲动，这时，就要有意识地让自己不具备自杀的条件。只要死不那么容易，自杀冲动就会再而衰、三而竭。 一般来讲，可以根据以下两种疾病状态来判断在现阶段休学或辞职是否合适。 如果是轻中度抑郁，你可能会有失眠或嗜睡等睡眠障碍，以及身体疲惫、缺乏精力、肠胃不适、头晕、头痛等常见的躯体化反应。这种情况下我们可以偶尔放松一下，远离学业或者工作的压力，比如给自己放一个小假休息一段时间。但这个时间一般不能超过三个月，如果超过三个月甚至达到半年之久，那就不是一次短暂的放松，而是在逃避。 如果是重度抑郁，你是没办法继续完成正常的学业和工作的，尤其是已经出现了一些木僵（身体僵住不能动）、妄想、幻觉的时候，不仅无法正常上学和工作，甚至还会出现一些伤害自己或他人的危险想法。 所以一旦确诊是重度抑郁，我们最需要做的是告诉家人，让他们帮自己做好保护，或者直接住院治疗，控制住病情，确保病情不会进一步恶化。 推荐书籍 《心理危机干预实用指导手册》施剑飞、骆宏主编 相关文章 过来人告诉你如何干预抑郁症患者自杀 尾言 本文章由寒涟漪结合大量参考文献进行整理。 这篇文章我其实写的非常非常的保守，文章所列出的所有的方法几乎都是没有任何法律风险以及对干预人本身造成伤害的风险的。通篇大量采用了已有多文献方法和普适方法。同时也回避了大量社群中存在的一些问题的干预方法。同时对于大量效果存疑/有争议/有人身安全风险/有法律风险的干预手段我都没有列出。 我其实在好几年前，就一直有想整理一个在跨性别社群中有力并且有效的危机干预手册了。但是说实话，直到今天为止，我也不知道具体什么方法才是社群干预最优的手段，如果一味的去照搬心理学和危机干预学的文献，就会存在严重水土不服的问题。但如果单方面的拿我自身的干预经历去总结，又极有可能产生严重的误导。 因为我在很早的时候就发现，绝大多数的危机干预文献在干预中国大陆地区的跨性别群体时都存在严重的水土不服的问题，尤其是在除了心理干预（谈话交流）以外的具体社会工作方面，这导致我曾经经历了大量的失败，甚至一度陷入“反文献，反权威”的极端境地中。 实际上，在我整理关于危机干预的相关文献时期发现，大量的危机干预文献有很多都是自相矛盾的。 有的文献鼓励你多说“一切都会好起来”。 有的文献则认为“一切都会好起来”属于敷衍且空洞的安慰，不能说。 有的文献认为在处理对方亲密的人离世时应该说“这不是你的错”。 有的文献则认为“这不是你的错”会加重对方的悲伤。 有的文献认为应当在询问对方“你有自杀的想法吗”的基础上进一步和对方讨论自杀方法。 有的文献则认为这是禁忌，讨论自杀方法会大幅度增加对方的自杀成功率。 有的文献认为讨论自杀方法可以进行错误的引导，起到增加自杀难度和拖延时间的目的来增加自杀干预的成功率。 有的文献则认为不应当对当事人进行任何意义上的知识类方面的欺骗，会有巨大风险。 这还仅仅是自杀干预方面的关于谈话交流的巨大争议点，关于实际的现实中的社会工作方法更是出现大量自相矛盾的内容。 并且这些自相矛盾的内容同时出现在不同的权威著作上。 但是到今天为止我仍然没有找到除了实践以外的最佳方法，而实践，是以人命为代价的。 但显然，整理指导手册是必须的，社群危机干预指导手册的意义其实非常的简单粗暴：有总比没有好。 就好像社群中很多不合格的干预者：贡献大于伤害，就是好的。 我早在很多年前就深深的意识到，只靠一个人的力量是永远不够的，只靠一个人，社群现状永远无法改变；永远都会有新的花瓣凋零。 哪怕手册的内容不全面，受到各种局限性，但只要对社群中的干预者起到一点点参考意义，都是有价值的。 同时我也能切身体会到绝大多数志愿者面临的窘境：有一颗想要帮人的心，却不知道从何做起，又不知道怎么做才能合适的，于是黯然退出。 希望以后这种情况会越来越少。 原文编辑于 2021-11-20 11:47 俺嘛，擅长倾听，不擅长表达。 如果你有什么想倾诉的，可以试试给俺发个邮件——邮箱是 admin@licaoz.com，我每一封邮件都有看，不过大概率收不到回信——俺真的不擅长表达:P","link":"/post/suicide-intervention-manual/"},{"title":"初三随笔","text":"How Time Flies! 不知不觉初三生活已经过了快一个月了，总想记录点什么却总是因为太懒和我那糟糕的文笔而咕咕。 2021年11月15日 随手借前人的基础糊了一个 工作室官网，感谢 HTML5 UP 大佬提供的各种免费模板。 又到了一天一度的“突然很想努力”时间，以后大概会把精力重心放在学习上，闭关修炼吧。 别提北大的 GeekGame 了，签到题我都不会做。 2021年11月10日 期中考试成绩出来啦 只要你不和我讨论那张单单（指成绩单），我们就是好朋友…… 2021年10月29日 是的，我终于记起更新咯！ 今天提了入团积极分子名单，班干部优先，有幸成为那三分之一~ 不过前些天提的团委貌似交晚了没我们的事了？ 周末了，可以好好拾掇拾掇我的小破站了（实际上还是没时间）。 2021年09月29日 呼，转眼明天下午就放假了—— 通知，各位家长：接上级通知，10月1日—7日为国庆节假期，现将相关事宜通知如下： 1、因放假调休，10月9日（周六）正常上班，全校教职工按周四工作安排到岗履职。 2、因放假，9月30日下午全校提前上课，1:15预备，1:30上课，第三节课后学生离校，务必强调注意疫情防控、路途交通、防溺水、防诈骗等安全事项。 3、10月7日下午，初中住读生及高中年级学生返校上晚自习，有异常情况注意上报。 合川中学9月29日 又是前一天晚上发通知，喝茶中学，不愧是你 2021年09月28日 不知不觉就月底了，周四放假，或许会更。 先来总结一下前面三周吧。 2021年09月21日 农历八月十五日 中秋节 星期三 感觉自己感受到了那种微妙的变化，从前两年桀骜到最后一年沉稳的变化。虽然不是初三才想要努力的，但更重视努力显然是在这初中的最后一年。 我们班团支书同学在我们多方劝说下和男朋友分手了，希望她在最后一年能够学有所成，毕竟进步空间还是蛮大的。 我们班那几位男同学（这里我就不指出了，指出来也没必要）依然很爱玩，也因为爱玩被我记了不知道多少次被夫人罚过几次清洁（这里的夫人指我们的班主任兼数学老师，是男的，以下同），不过也不全是我记的啦（甩锅.webp） 翻了翻我那本教委做的象征无限权力的班班通使用情况登记簿——对就是你们印象中的班班通——说人话就是讲台上的多媒体，看着记了将近3页纸的记录我陷入了沉思…… 没什么好沉思的，等到学期末做个统计吧，又是一个立马倒掉的Flag 总结一下，我们的各项教育工作都在有条不紊按部就班地进行着（完了我怎么感觉我在写公文）除了…… 语文老师从来不会按书上的课文顺序来讲，虽然每个学期都讲不完一本书但要考的地方都是讲过的。 数学因为上学期学过并且也考完了一元二次方程，所以这学期直接从二次函数讲起。 物理直接跳过了内能和比热容、热机（因为小中考不考这玩意）——但开学考考了这玩意——我依旧清晰地记得我开学考两节干电池电压写的60V哈哈哈操，这学期从电学讲起。 一说到开学考……我看不到具体名次——只知道是年级300名之内——虽说上本部大概没问题，但我想这学期期末指标到校直接直升……想屁吃呢我们年级比我好的人多了去了 好了，就写这么多吧，下次随缘更新~","link":"/post/third-grade-essays/"},{"title":"[维护]评论系统关闭","text":"鉴于可能因为依赖 GitHub Issue 的评论系统在部分网络环境下不友好而导致的站点评论使用率低 绝对不是本来就冷清，哼，再加之本站正进行网安备案、目前采用的后端不符合相关要求，所以关闭了评论。 多次尝试 WordPress 但貌似不怎么适合我这种习惯了 Typecho 的人，又没见 Typecho 交互式备案合规性改造的相关文章，所以暂时关闭评论直至我找到~~优雅的~~解决方案 有没有会玩 WP 的啊带带弟弟呜呜呜","link":"/post/turn-off-comment-system/"},{"title":"[转载]当博客已不再流行，我们该何去何从","text":"前排提示：文章仅代表个人观点，如与您观点违背，还请包涵，希望每一位点进这篇文章的访客，都能仔细看完它。 随着时光一点点流逝，我们的生活中“博客”这个名词是否已经被淡忘。 一年前，我建立了我的第一个博客“何叶博客”，写下了自己的第一篇文章，但由于后来主机过期导致数据丢失了。写下这篇文章时，我正运营着我的第4个（应该叫第四轮罢）博客“忆梦小站”。 还记得我第一次建立博客的时候，已经把自己要写什么，发到什么地方规划好了，但是突如其来的主机过期导致我发现应该寻找一个靠谱的互联。 紧接着，第二个博客建立，我换到了一个相对较大的互联，使用了wp系统，但是却不知应该写一点什么，然后变把它删掉改成了导航网（已经不做了）。 第三个博客用了鲶鱼的系统，然后改成了tp，用了大佬“熊猫小A”写的主题（名字忘记了），这也就是为什么我的博客的关于里面有这个名字。 接下来，便是忆梦小站，自我建立她的第一天起，我变决定要好好运营她。一年服务器，两年域名，也借用身边朋友的信息备了案（事先征得同意&amp;之所以这么做是因为我年龄没到管局要求）。 一开始用的是Aira，在看了友人C大佬的博客之后换成了handsome。虽然当时买的时候价格对于我是略贵的（因为穷），但是我认为好的主题再贵也值得。 2019年，博客这个名词逐渐淡出人们的生活，转而取代的是公众号、看点等适应现代人快生活的新媒体。许多博客为了迎合访客分发改成了资源网，分享一些活动、源码等等。 现在，平均每十个写着“博客”字样的网站就有7个资源网，还有1个是新建的博客。 许多站长写博客没1周变匆匆退出，因为“博客不赚钱”“博客没人看”“没有题材写”… 而真正努力做的博客，被许多资源网埋在了深处。 我曾经反思过，为什么好多博客站长都说自己访客还不如一个资源网多。对此，我总结出以下原因： 博客更新慢，资源网轻轻松松一天5篇文章 博客文章长，访客没心思看 博客的内容大都以技术、生活为主，没新意 博客的文章数目较少 博客站长大都不会疯狂宣传自己的站点 博客大都是以低配服务器搭建的，没有考虑访客压力问题，而资源网却是冲着迎接攻击的配置 在这个信息高速时代，想要访问量和盈利，就要顺应访客的爱好。但如若真的这样了，那么个人博客不就“失其本心”了么？ 时代改变很快，往日追随的博客，今日能维持更新的可谓为数不多，进而代替的是在微博或朋友圈发个图片配上只字片语。或许是人们的生活习惯改变了，每天忙碌繁琐的工作已经占据了太多时间，已没有闲暇去记录东西。也有很多朋友拿起笔或者打开电脑，发现并没什么东西可写。并非说是思绪尽竭，只是人生翻来覆去也就是那些事儿，说不上千遍一律但也被史上无数文人墨客写了几千多年，该写的都写了。再看看四周，自己画地为牢固步于一室工作也有许多年头，除了偶尔的走马观花，外面真实的风景、异地的人文习俗，都显得如此陌生。花花草草早已写腻，情情爱爱却又过于隐私不敢流露，所以很多人的博客就定格在某个日期，很久没有改变。——本段引用，片段来自一叶轻舟漂，文章链接在文末注明 或许，博客的最终归宿，不过是以微弱的力量支撑着那些喜爱者博客的用户访问罢。 忆梦小站也前前后后分享了许多博主所想分享的内容，写写删删，访客来来往往，也非常感谢你能访问忆梦小站并看到这里。总是在漆黑的夜晚看着电脑前寥寥无几的访客量，却不知如何开口。 或许，是世界变了，我们却未变罢。 忆梦小站自建站以来购买服务器&amp;域名的费用大约150元左右，却因为被恶意攻击亏损了220元左右。我所最不能理解的就是，我明明没有招惹你，你为什么要来伤害我。个人博客的站长往往并没有收入，自运营开始便是亏本的历程，受到攻击由于没有公司资金支持和防御往往需要自己掏钱来为攻击者的行为付费。 现在的攻击成本低至20一个月无限攻击，但是某互联对于DDOS攻击清洗服务的的价格确是3000元一个月，仅仅10G基准防御，100G弹性防御（正常情况最多50G，因为有别的用户共享）。 我曾看过一个B站up，他提到了一个值得我们反思的问题“为什么我们不是他”。很多人做网站的时候，总是想着，自己为什么不是那个第一个写出或者创造某某源码的人，为什么自己没办法如他一样大卖源码使用权赚钱费用。 是啊，为什么我们不是那第一人呢？总是在他人成功之后才在懊悔，自己为什么没有想到那个点子，自己为什么当时没有与他合作。 一味地渴望赚钱，到头来还不是什么都没有。 博客，本不该不盈利，只是我最终的归宿，是属于站长和访客的领域。 不为访客而存在，不去选择迎合他人，而让用户来寻找你。 所以，不要为了访客而烦恼，把自己心中的希望，做到最好，就无悔。 曾经有一次我在外面的群宣传了我的博客，一个人（喷子）便急不可耐地向我发来回复“博客都过时了，现在都是资源网，你这个站算什么，信不信等下把你打死。” 怀抱着这人是故意喷我的想法，熄灭了点灯，躺倒床上，却久久不能入睡。 那晚，我3点才进入梦乡。我也想明白了，信息高速发展的今天，许多东西都是很容易过时的，比如前几年一些网站做的风生水起，最终却因用户数量锐减而倒闭。 B站也是，QQ亦是，终有一天，它们会离我们而去，但我知道，在它们最风光的时候，守在真正喜欢者的软件/网站前，便足矣。 愿与你相随，不论风光年华，不论他人离去，只因，我从一开始，便为守护你而来。——后记 思路&amp;引用片段来自：https://www.jetchou.com/sanwen/216.html 本文原作者 何叶，原文链接：https://www.onyi.net/archives/194.html","link":"/post/where-do-we-go-when-blogging-is-no-longer-popular/"}],"tags":[{"name":"互联网","slug":"互联网","link":"/tags/%E4%BA%92%E8%81%94%E7%BD%91/"},{"name":"GPG","slug":"GPG","link":"/tags/GPG/"},{"name":"密码学","slug":"密码学","link":"/tags/%E5%AF%86%E7%A0%81%E5%AD%A6/"},{"name":"Hackergame","slug":"Hackergame","link":"/tags/Hackergame/"},{"name":"域名","slug":"域名","link":"/tags/%E5%9F%9F%E5%90%8D/"},{"name":"化学","slug":"化学","link":"/tags/%E5%8C%96%E5%AD%A6/"},{"name":"笔记","slug":"笔记","link":"/tags/%E7%AC%94%E8%AE%B0/"},{"name":"物理","slug":"物理","link":"/tags/%E7%89%A9%E7%90%86/"},{"name":"Microsoft Office","slug":"Microsoft-Office","link":"/tags/Microsoft-Office/"},{"name":"强国少年","slug":"强国少年","link":"/tags/%E5%BC%BA%E5%9B%BD%E5%B0%91%E5%B9%B4/"},{"name":"共青团","slug":"共青团","link":"/tags/%E5%85%B1%E9%9D%92%E5%9B%A2/"},{"name":"少先队","slug":"少先队","link":"/tags/%E5%B0%91%E5%85%88%E9%98%9F/"},{"name":"感情","slug":"感情","link":"/tags/%E6%84%9F%E6%83%85/"},{"name":"自杀","slug":"自杀","link":"/tags/%E8%87%AA%E6%9D%80/"}],"categories":[{"name":"密码学","slug":"密码学","link":"/categories/%E5%AF%86%E7%A0%81%E5%AD%A6/"},{"name":"CTF","slug":"CTF","link":"/categories/CTF/"},{"name":"笔记","slug":"笔记","link":"/categories/%E7%AC%94%E8%AE%B0/"},{"name":"Microsoft Office","slug":"Microsoft-Office","link":"/categories/Microsoft-Office/"},{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"}]}